Merged nchteamnch/bscrypt into forked repo master
