--- a/misc/hll_investigation/docs/Investigation.md
+++ b/misc/hll_investigation/docs/Investigation.md
@@ -31,47 +35,47 @@ The highlighted impression is that Ethereum has the best quality in all measures
+    * Debugger : Not as easy as other tools.
+    * Executor : Already exist in bitcoin code (EvalScript).
 
-```plantuml
-@startuml
-package "Language Foundation" {
-[Grammar design]
-[Grammar parser]
-[Grammar parser] -left-> [Grammar design]
-}
-package "BSV" {
-[Script Engine]
-[BSV CORE]
-}
-cloud "Tools" {
-[Compiler]
-[Executor]
-[IDE]
-[Debugger]
+```mermaid
+graph BT
+  subgraph Language foundation
+    A1[Grammar design]
+    A2[Grammar parser]
+    A2 ==>A1
+  end
+  subgraph BSV
+    B1[Script Engine]
+    B2((BSV Core))
+  end
+  B1 -.- B2
 
-}
-
-[Compiler] -up-> [Grammar parser]
-[Compiler] -up-> [Script Engine]
-
-[IDE] -up-> [Grammar parser]
-
-[Executor] -up-> [Script Engine]
-[Executor] -up-> [BSV CORE]
-
-[Debugger] -up-> [IDE]
-[Debugger] -up-> [Executor]
-@enduml
+  subgraph Programming Tools
+    C1[IDE]
+    C2[Compiler]
+    C3[Executor]
+    C4[Debugger]
+  end
+  C1 --> A2
+  C2 --> A2
+  C2 --> B1
+  C3 --> B1
+  C3 --> B2
+  C4 --> C1
+  C4 --> C3
+  style B1 fill:#FCCB29,stroke:#D9280D,stroke-width:2px
+  style B2 fill:#67BCC9,stroke:#FCCB29,stroke-width:4px
 ```
